<script setup>
    import Rating from '@/components/Rating.vue';
    import btn from '@/components/HeaderButtonSvg.vue';

</script>

<template>
    <div class="cont">
        <div class="d1">
            <div class="name">
                Данило Кокоцький
            </div>
            <div class="date">
                30 мая 2022
            </div>

        </div>
        <div class="d2">
            <div><rating class="rating" :stars="4" color-active='#00ffff'/><NuxtLink>Пожаловаться</NuxtLink></div>
            <div>Даже не знаю, как описать ощущения от покупки…Давно хотел себе
                Найк,настоящий, оригинальный. Наверное придётся все-таки покупать
                в штатах через кучу неудобств, чтобы такие получить. Эти оставил, так
                как сели неплохо. В целом, качество очень сомнительное-куча клея
                по кромке подошвы,какая-то грубость что ли заметна.
            </div>
            <div>
                <NuxtLink>Ответить</NuxtLink> 
                <div class="icons">
                    <div class="icon">
                        <svg xmlns="http://www.w3.org/2000/svg" height="20px" width="20px" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 50 50">
                            <path d="M46.58,33.41c3.18-5.46-0.98-5.49,0.08-7.38c1.06-1.88-0.51-4.91-0.51-4.91s-0.24-0.33-2.91-1.98
                                c-2.67-1.66-11.97,0.09-11.97,0.09s0.18-2.67,1.2-5.53c0.45-1.27,0.72-2.48,0.88-3.41c0.19-1.14,0.12-2.3-0.19-3.41l-0.29-1.03
                                c-0.2-0.71-0.58-1.36-1.1-1.88l-0.56-0.56c-0.2-0.2-0.43-0.35-0.68-0.47l-0.55-0.25c-0.6-0.27-1.24-0.46-1.89-0.57L26.69,1.9
                                c-0.31-0.05-0.62,0.05-0.84,0.27l0,0c-0.71,0.71-1.12,1.68-1.1,2.69c0.01,0.68-0.01,1.6-0.12,2.76c-0.27,2.75-5.17,10.42-5.56,11.04
                                c-0.02,0.03-0.43,0.67-0.45,0.69l-1.54,1.61c-0.36,0.38-0.68,0.79-0.96,1.23l-1.24,2l0,0.06c-0.53-0.33-1.15-0.52-1.81-0.52H6.28
                                c-1.91,0-3.47,1.56-3.47,3.47v17.1c0,1.91,1.56,3.47,3.47,3.47h6.78c0.79,0,1.5-0.27,2.09-0.72v0c7.18,1.21,20.02,1.57,25.16,0
                                c5.14-1.57,4.47-6.91,4.47-6.91c3.1-2.47,1.73-6.4,1.73-6.4S43.41,38.86,46.58,33.41z M14.25,44.14c0,0.61-0.5,1.1-1.1,1.1H6.63
                                c-0.61,0-1.1-0.5-1.1-1.1V27.85c0-0.61,0.5-1.1,1.1-1.1h6.51c0.61,0,1.1,0.5,1.1,1.1V44.14z M42.13,39.17l-0.24,0.71
                                c0,0,1.31,3.5-2.38,4.75c-3.68,1.25-5.76,1.13-11.7,0.89s-11.29-0.83-11.29-0.83v-0.38v-17.1v-0.46c0,0,0.54-1.84,2.5-3.74
                                c1.88-1.82,5.78-8.9,6.34-10.4c0.11-0.29,1.24-3.04,1.24-3.04c0.44-1.02,0.64-2.12,0.61-3.23c-0.02-0.84-0.02-1.71,0.07-1.8
                                c0,0,4.1-0.12,3.5,4.45c0,0-0.12,2.55-1.9,7.96c0,0-0.7,3.63,0.48,4.39h0c0.77,0.5,1.7,0.67,2.59,0.48l2.28-0.48
                                c0,0,5.88-0.89,7.9,0c2.02,0.89,3.09,2.07,1.6,5.08c0,0,3.33,3.12-0.06,6.39l-0.06,0.59C43.61,33.41,45.75,36.85,42.13,39.17z"/>
                        </svg>
                        0
                    </div>

                    <div class="icon">
                        <svg xmlns="http://www.w3.org/2000/svg" height="20px" width="20px" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 50 50">
                            <path d="M46.58,16.59c3.18,5.46-0.98,5.49,0.08,7.38c1.06,1.88-0.51,4.91-0.51,4.91s-0.24,0.33-2.91,1.98
                                c-2.67,1.66-11.97-0.09-11.97-0.09s0.18,2.67,1.2,5.53c0.45,1.27,0.72,2.48,0.88,3.41c0.19,1.14,0.12,2.3-0.19,3.41l-0.29,1.03
                                c-0.2,0.71-0.58,1.36-1.1,1.88l-0.56,0.56c-0.2,0.2-0.43,0.35-0.68,0.47l-0.55,0.25c-0.6,0.27-1.24,0.46-1.89,0.57l-1.39,0.22
                                c-0.31,0.05-0.62-0.05-0.84-0.27l0,0c-0.71-0.71-1.12-1.68-1.1-2.69c0.01-0.68-0.01-1.6-0.12-2.76c-0.27-2.75-5.17-10.42-5.56-11.04
                                c-0.02-0.03-0.43-0.67-0.45-0.69l-1.54-1.61c-0.36-0.38-0.68-0.79-0.96-1.23l-1.24-2l0-0.06c-0.53,0.33-1.15,0.52-1.81,0.52H6.28
                                c-1.91,0-3.47-1.56-3.47-3.47V5.69c0-1.91,1.56-3.47,3.47-3.47h6.78c0.79,0,1.5,0.27,2.09,0.72v0c7.18-1.21,20.02-1.57,25.16,0
                                c5.14,1.57,4.47,6.91,4.47,6.91c3.1,2.47,1.73,6.4,1.73,6.4S43.41,11.14,46.58,16.59z M14.25,5.86c0-0.61-0.5-1.1-1.1-1.1H6.63
                                c-0.61,0-1.1,0.5-1.1,1.1v16.29c0,0.61,0.5,1.1,1.1,1.1h6.51c0.61,0,1.1-0.5,1.1-1.1V5.86z M42.13,10.83l-0.24-0.71
                                c0,0,1.31-3.5-2.38-4.75c-3.68-1.25-5.76-1.13-11.7-0.89c-5.94,0.24-11.29,0.83-11.29,0.83v0.38v17.1v0.46c0,0,0.54,1.84,2.5,3.74
                                c1.88,1.82,5.78,8.9,6.34,10.4c0.11,0.29,1.24,3.04,1.24,3.04c0.44,1.02,0.64,2.12,0.61,3.23c-0.02,0.84-0.02,1.71,0.07,1.8
                                c0,0,4.1,0.12,3.5-4.45c0,0-0.12-2.55-1.9-7.96c0,0-0.7-3.63,0.48-4.39h0c0.77-0.5,1.7-0.67,2.59-0.48l2.28,0.48
                                c0,0,5.88,0.89,7.9,0c2.02-0.89,3.09-2.07,1.6-5.08c0,0,3.33-3.12-0.06-6.39l-0.06-0.59C43.61,16.59,45.75,13.15,42.13,10.83z"/>
                        </svg>
                        12
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<style lang="scss" scoped>

a
{
    color:var(--light-color-text);
    font-size: 12px;

}

.icons
{
    display: flex;
    height: 100%;
    width: 100px;
    justify-content: space-between;
    color: var(--light-color-text);

    .icon
    {
        display: flex;
        align-items: center;
        >svg
        {
            margin-right: 10px;
            fill: var(--light-color-text);
        }
    }
}
.name
{  
    font-weight: bold;
}

.date
{
    color:var(--light-color-text);
    font-weight:lighter;
}

.cont
{
    display: flex;
    background-color: rgb(255, 255, 255);
    // font-size: var(--fontsize-light-small-default);
    font-size: 12px;
    padding-top: 15px;

}
.d1 
{
    width: 39.5%;
    padding-top: 5px;

    >div
    {
        display: flex;
        justify-content: space-between;
        // min-height: 10px;
        align-items: center;
        // padding-top: 10px;
        padding-bottom: 10px;
    }
}

.d2 
{
    width: 60.5%;

    >div
    {
        display: flex;
        justify-content: space-between;
        min-height: 35px;
        align-items: center;
        line-height: 18px;
        // padding-top: 10px;
        padding-bottom: 10px;
    }
}
</style>